###################################################################

# Created by write_sdc on Sat Jan 20 20:29:27 2018

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_mode top
set_wire_load_model -name smic18_wl50 -library typical
set_load -pin_load 2 [get_ports OK]
set_load -pin_load 2 [get_ports {DOUT[7]}]
set_load -pin_load 2 [get_ports {DOUT[6]}]
set_load -pin_load 2 [get_ports {DOUT[5]}]
set_load -pin_load 2 [get_ports {DOUT[4]}]
set_load -pin_load 2 [get_ports {DOUT[3]}]
set_load -pin_load 2 [get_ports {DOUT[2]}]
set_load -pin_load 2 [get_ports {DOUT[1]}]
set_load -pin_load 2 [get_ports {DOUT[0]}]
set_ideal_network [get_ports CLK]
set_ideal_network [get_ports RSTB]
create_clock [get_ports CLK]  -name clk  -period 20  -waveform {0 10}
set_clock_latency -max 4  [get_clocks clk]
set_clock_latency -source 2  [get_clocks clk]
set_clock_uncertainty 1.1  [get_clocks clk]
set_clock_transition -rise 2 [get_clocks clk]
set_clock_transition -fall 2 [get_clocks clk]
set_input_delay -clock clk  5  [get_ports RSTB]
set_input_delay -clock clk  5  [get_ports START]
set_input_delay -clock clk  5  [get_ports WR]
set_input_delay -clock clk  5  [get_ports {DIN[7]}]
set_input_delay -clock clk  5  [get_ports {DIN[6]}]
set_input_delay -clock clk  5  [get_ports {DIN[5]}]
set_input_delay -clock clk  5  [get_ports {DIN[4]}]
set_input_delay -clock clk  5  [get_ports {DIN[3]}]
set_input_delay -clock clk  5  [get_ports {DIN[2]}]
set_input_delay -clock clk  5  [get_ports {DIN[1]}]
set_input_delay -clock clk  5  [get_ports {DIN[0]}]
set_input_delay -clock clk  5  [get_ports {ADDR[6]}]
set_input_delay -clock clk  5  [get_ports {ADDR[5]}]
set_input_delay -clock clk  5  [get_ports {ADDR[4]}]
set_input_delay -clock clk  5  [get_ports {ADDR[3]}]
set_input_delay -clock clk  5  [get_ports {ADDR[2]}]
set_input_delay -clock clk  5  [get_ports {ADDR[1]}]
set_input_delay -clock clk  5  [get_ports {ADDR[0]}]
set_input_transition -max 2  [get_ports CLK]
set_input_transition -min 2  [get_ports CLK]
set_input_transition -max 2  [get_ports RSTB]
set_input_transition -min 2  [get_ports RSTB]
set_input_transition -max 2  [get_ports START]
set_input_transition -min 2  [get_ports START]
set_input_transition -max 2  [get_ports WR]
set_input_transition -min 2  [get_ports WR]
set_input_transition -max 2  [get_ports {DIN[7]}]
set_input_transition -min 2  [get_ports {DIN[7]}]
set_input_transition -max 2  [get_ports {DIN[6]}]
set_input_transition -min 2  [get_ports {DIN[6]}]
set_input_transition -max 2  [get_ports {DIN[5]}]
set_input_transition -min 2  [get_ports {DIN[5]}]
set_input_transition -max 2  [get_ports {DIN[4]}]
set_input_transition -min 2  [get_ports {DIN[4]}]
set_input_transition -max 2  [get_ports {DIN[3]}]
set_input_transition -min 2  [get_ports {DIN[3]}]
set_input_transition -max 2  [get_ports {DIN[2]}]
set_input_transition -min 2  [get_ports {DIN[2]}]
set_input_transition -max 2  [get_ports {DIN[1]}]
set_input_transition -min 2  [get_ports {DIN[1]}]
set_input_transition -max 2  [get_ports {DIN[0]}]
set_input_transition -min 2  [get_ports {DIN[0]}]
set_input_transition -max 2  [get_ports {ADDR[6]}]
set_input_transition -min 2  [get_ports {ADDR[6]}]
set_input_transition -max 2  [get_ports {ADDR[5]}]
set_input_transition -min 2  [get_ports {ADDR[5]}]
set_input_transition -max 2  [get_ports {ADDR[4]}]
set_input_transition -min 2  [get_ports {ADDR[4]}]
set_input_transition -max 2  [get_ports {ADDR[3]}]
set_input_transition -min 2  [get_ports {ADDR[3]}]
set_input_transition -max 2  [get_ports {ADDR[2]}]
set_input_transition -min 2  [get_ports {ADDR[2]}]
set_input_transition -max 2  [get_ports {ADDR[1]}]
set_input_transition -min 2  [get_ports {ADDR[1]}]
set_input_transition -max 2  [get_ports {ADDR[0]}]
set_input_transition -min 2  [get_ports {ADDR[0]}]
